{
    "header": {
      "english": "English",
      "polish": "Polish",
      "spanish": "Spanish",
      "title": "Hi!! I'm Rashi Chugani."
    },

    "footer": {
        "copyright": " All rights reserved."
    },

    "skill": {
        "title": "Skills"
    },

    "skill-cards": [
        {
            "logo": "/src/assets/imgs/python.png",
            "name": "Python",
            "description": "I have been using it since the beginning of the web application development course. It is essential for programming logic and backend development.",
            "level": "3"
        },
        {
            "logo": "/src/assets/imgs/bootstrap.png",
            "name": "Bootstrap",
            "description": "We recently started using it to streamline web design with a modern and responsive approach.",
            "level": "3"
        },
        {
            "logo": "/src/assets/imgs/html.png",
            "name": "HTML",
            "description": "I have been using it since the start of the course to efficiently structure and develop web pages.",
            "level": "4"
        },
        {
            "logo": "/src/assets/imgs/django.png",
            "name": "Django",
            "description": "Although I started using it recently, I have already developed several dynamic web applications with this framework.",
            "level": "4"
        },
        {
            "logo": "/src/assets/imgs/vue.png",
            "name": "Vue",
            "description": "I am learning this progressive framework for building interactive and scalable web applications.",
            "level": "3"
        },
        {
            "logo": "/src/assets/imgs/javascript.png",
            "name": "JavaScript",
            "description": "I am still exploring its potential, but I have already used it to add interactivity to web pages.",
            "level": "2"
        },
        {
            "logo": "/src/assets/imgs/css.png",
            "name": "CSS",
            "description": "Since the beginning of the course, I have used it to design and customize the appearance of web pages.",
            "level": "3"
        },
        {
            "logo": "/src/assets/imgs/sql.png",
            "name": "SQL",
            "description": "I used it during the first year of the course to manage databases and perform efficient queries.",
            "level": "3"
        }
    ],

    "work": {
        "title": "Projects"
    },

    "project-cards-button": {
        "text": "View Source"
    },
    
    "project-cards": [
        {
            "title": "Lumino",
            "tag": "Educational platform designed for students and teachers.",
            "description": "This project uses Django to generate HTML, manage users from the backend, and send emails, with decoupled tasks to improve performance.",
            "url": "https://github.com/Chugani05-JesusLugo2002/Lumino"
        },
        {
            "title": "Jukabox",
            "tag": "Social media for music lovers.",
            "description": "This project is a full-stack app using Vue.js for the front-end and Django for the back-end, integrated with the MusicBrainz API to fetch and display music data like artists, albums, and tracks.",
            "url": "https://github.com/Chugani05-JesusLugo2002/Jukabox"
        },
        {
            "title": "ShoppingCart",
            "tag": "Online book shop.",
            "description": "This project uses Google Firebase for database management and user authentication, with a front-end developed in Vue.js and TypeScript.",
            "url": "https://github.com/Chugani05/ShoppingCart"
        },
        {
            "title": "GameSide",
            "tag": "Videogame API.",
            "description": "This project involves creating a custom API without using Rest Framework, implementing custom serializers to handle requests and responses.",
            "url": "https://github.com/Chugani05-JesusLugo2002/GameSide"
        }
    ],

    "about": {
        "tag": "Web Developer & Student",
        "p1": "Hello! My name is Rashi Chugani Narwani. I’m of Indian heritage, born and raised in Tenerife, Spain.",
        "p2": "I’m a passionate web developer currently studying. I love creating user-friendly and visually appealing websites and applications, always eager to explore the latest technologies and best practices.",
        "p3": "Beyond coding, I enjoy expressing my creativity through reading, baking, building Legos, painting, drawing, and photography. Whether it’s designing with colors and bricks, capturing moments with my camera, or crafting delicious treats, these hobbies allow me to relax and explore new creative outlets." 
    }
}