{
    "header": {
      "english": "Inglés",
      "polish": "Polaco",
      "spanish": "Español",
      "title": "Hola!! Soy Rashi Chugani."
    },

    "footer": {
        "copyright": " Todos los derechos reservados."
    },

    "skill": {
        "title": "Habilidades"
    },

    "skill-cards": [
        {
            "logo": "/src/assets/imgs/python.png",
            "name": "Python",
            "description": "Llevo utilizándolo desde el inicio del curso de desarrollo de aplicaciones web. Es fundamental para la lógica de programación y el desarrollo backend.",
            "level": "3"
        },
        {
            "logo": "/src/assets/imgs/bootstrap.png",
            "name": "Bootstrap",
            "description": "Recientemente comenzamos a utilizarlo para agilizar el diseño de páginas web con un enfoque moderno y responsivo.",
            "level": "3"
        },
        {
            "logo": "/src/assets/imgs/html.png",
            "name": "HTML",
            "description": "Desde el inicio del curso, lo he utilizado para estructurar y desarrollar páginas web de manera eficiente.",
            "level": "4"
        },
        {
            "logo": "/src/assets/imgs/django.png",
            "name": "Django",
            "description": "Aunque lo empecé a usar recientemente, ya he desarrollado varias aplicaciones web dinámicas con este framework.",
            "level": "4"
        },
        {
            "logo": "/src/assets/imgs/vue.png",
            "name": "Vue",
            "description": "Estoy aprendiendo este framework progresivo para el desarrollo de aplicaciones web interactivas y escalables.",
            "level": "3"
        },
        {
            "logo": "/src/assets/imgs/javascript.png",
            "name": "JavaScript",
            "description": "Aún estoy explorando su potencial, pero ya lo he utilizado para agregar interactividad a páginas web.",
            "level": "2"
        },
        {
            "logo": "/src/assets/imgs/css.png",
            "name": "CSS",
            "description": "Desde el inicio del curso, lo he usado para diseñar y personalizar la apariencia de las páginas web.",
            "level": "3"
        },
        {
            "logo": "/src/assets/imgs/sql.png",
            "name": "SQL",
            "description": "Lo utilicé durante el primer año del curso para gestionar bases de datos y realizar consultas eficientes.",
            "level": "3"
        }
    ],

    "work": {
        "title": "Proyectos"
    },

    "project-cards-button": {
        "text": "Ver código fuente"
    },

    "project-cards": [
        {
            "title": "Lumino",
            "tag": "Plataforma educativa diseñada para estudiantes y profesores",
            "description": "Este proyecto usa Django para generar HTML, gestionar usuarios desde el back-end y enviar correos electrónicos, con tareas desacopladas para mejorar el rendimiento.",
            "url": "https://github.com/Chugani05-JesusLugo2002/Lumino"
        },
        {
            "title": "Jukabox",
            "tag": "Redes sociales para amantes de la música.",
            "description": "Este proyecto es una aplicación completa que utiliza Vue.js para el front-end y Django para el back-end, integrada con la API MusicBrainz para obtener y mostrar datos musicales como artistas, álbumes y pistas.",
            "url": "https://github.com/Chugani05-JesusLugo2002/Jukabox"
        },
        {
            "title": "ShoppingCart",
            "tag": "Tienda de libros en línea.",
            "description": "Este proyecto utiliza Google Firebase para la gestión de base de datos y autenticación de usuarios, con un front-end desarrollado en Vue.js y TypeScript.",
            "url": "https://github.com/Chugani05/ShoppingCart"
        },
        {
            "title": "GameSide",
            "tag": "API de videojuegos.",
            "description": "Este proyecto consiste en la creación de una API personalizada sin utilizar Rest Framework, implementando serializadores propios para manejar las peticiones y respuestas.",
            "url": "https://github.com/Chugani05-JesusLugo2002/GameSide"
        }
    ],

    "about": {
        "tag": "Desarrolladora web y estudiante",
        "p1": "Hola!! Me llamo Rashi Chugani Narwani y soy una apasionada desarrolladra web que actualmente está estudiando. Disfruto crear sitios web y aplicaciones intuitivas y visualmente atractivas, y siempre me esfuerzo por aprender las últimas tecnologías y las mejores prácticas.",
        "p2": "Cuando no estoy programando, disfruto explorando mi lado creativo leyendo, horneando, construyendo Legos, pintando, dibujando y fotografiando. Ya sea preparando delicias, capturando momentos con mi cámara o dando vida a los diseños con colores o ladrillos, estos pasatiempos me permiten relajarme y expresarme de maneras únicas."
    }
}